#!/usr/bin/env python3

"""ОПИСАНИЕ:
Это продолжение Chain Reaction - Explosions с теми же настройками, но с другим
вкусом. Как и в предыдущей части, вам будет предоставлен прямоугольный массив,
представляющий "карту" с тремя типами пробелов:

Бомбы "+": при активации их взрыв активирует любые бомбы непосредственно над,
под, слева или справа от бомбы "+".
Бомбы "x": при активации их взрыв активирует любые бомбы, размещенные в любом
из четырех диагональных направлений рядом с бомбой "x".
Пустые пробелы "0".

Цель проста: получив карту, верните минимальное количество бомб, которые
необходимо взорвать, чтобы все бомбы были уничтожены в результате цепной
реакции.
Давайте рассмотрим несколько примеров:
[
["+", "+", "+", "0", "+", "+", "+"],
["+", "+", "+", "0", "0", "+", "+"]
]
Для карты выше ответ таков 2; чтобы взорвать все бомбы, вам просто нужно
взорвать одну бомбу "+" в правом кластере и одну в левом кластере.
[
["x", "0", "x"],
["x", "x", "x"]
]
Для карты выше ответ таков 3; очевидно, что достаточно установить три нижние
бомбы "x", и не менее трех бомб будет достаточно.
[
["x", "x", "x", "0", "x"],
["x", "x", "x", "x", "x"],
["x", "x", "x", "0", "x"]
]
Для карты выше ответ таков 3; срабатывание трех крайних правых бомб в среднем
ряду сделает свое дело.

Примеры
min_bombs_needed([
["+", "+", "+", "0", "+", "+", "+"],
["+", "+", "+", "0", "0", "+", "+"]
]) ➞ 2

min_bombs_needed([
["x", "0", "x"],
["x", "x", "x"]
]) ➞ 3

min_bombs_needed([
["x", "x", "x", "0", "x"],
["x", "x", "x", "x", "x"],
["x", "x", "x", "0", "x"]
]) ➞ 3
Примечания
Обратите внимание, что как бомбы "+", так и бомбы "x" имеют "дальность взрыва",
равную 1.
"""
from collections import deque

"""MY COMMENT: Реализация алгоритма для бомб типа '+' и для бомб типа 'x'."""


def pprint(matr: list) -> None:
    for row in matr:
        print(row)


def find_p(arr: list) -> tuple:
    for i, row in enumerate(arr):
        for j, el in enumerate(row):
            if el == '+':
                return i, j, '+'
    return -1, -1, None


def find_x(arr: list) -> tuple:
    for i, row in enumerate(arr):
        for j, el in enumerate(row):
            if el == 'x':
                return i, j, 'x'
    return -1, -1, None


def blow_bombs(a: list, bomb_pos: tuple, c: int, bomb_type: str):
    incr = deque([])
    p = deque([(0, 0), (0, 1), (1, 0), (-1, 0), (0, -1)])
    x = deque([(0, 0), (-1, 1), (1, 1), (1, -1), (-1, -1)])
    if bomb_type == '+': incr = p
    elif bomb_type == 'x': incr = x
    incr_len = len(incr)

    blowed = [[bomb_pos, bomb_type]]
    k = 0

    while k < len(blowed):
        current_pos, bomb_type = blowed[k]
        i, j = current_pos
        if bomb_type == '+': incr = p
        elif bomb_type == 'x': incr = x
        for _ in range(incr_len):
            di, dj = incr[0]
            i, j = i + di, j + dj
            if len(a) > i >= 0 and len(a[i]) > j >= 0:
                if a[i][j] not in "~0":
                    near = a[i][j]
                    a[i][j] = '~'
                    if [(i, j), near] not in blowed:
                        blowed.append([(i, j), near])
            incr.rotate(-1)
            i, j = current_pos
        k = k + 1
    c = c + 1
    return c, a


def get_min_bombs(a: list) -> int:
    c = -1
    bomb_type = ''
    while bomb_type is not None:
        t = find_p(a)
        bomb_type = t[2]
        if bomb_type is None:
            t = find_x(a)
        bomb_pos, bomb_type = (t[0], t[1]), t[2]
        c, a = blow_bombs(a, bomb_pos, c, bomb_type)
    return c


def main():
    tests = [
        # ([["+", "+", "0", "+", "+"],
        #   ["+", "+", "+", "+", "+"]], 1),

        # ([["+", "+", "+", "0", "+", "+", "+"],
        #   ["+", "+", "+", "0", "0", "+", "+"]], 2),

        # ([["+", "+", "0", "+", "0", "+", "+", "+"],
        #   ["+", "+", "0", "+", "0", "0", "+", "+"]], 3),

        # ([["+", "0", "+", "0", "+", "0", "+"],
        #   ["+", "+", "+", "+", "+", "+", "+"]], 1),

        # ([["+", "0", "+", "+", "+", "+", "+"],
        #   ["+", "+", "+", "0", "0", "+", "+"]], 1),

        # ([['0', '+', '+', '0', '+', '0', '+'],
        #   ['0', '0', '+', '0', '+', '0', '+'],
        #   ['0', '+', '+', '0', '+', '0', '+']], 3),

        # ([["+", "+", "+", "+", "+", "+", "+"],
        #   ['0', '0', '+', '0', '0', '0', '0'],
        #   ['0', '0', '+', '0', '0', '0', '0'],
        #   ["0", "0", "+", "+", "+", "+", "+"]], 1),

        # ([['+', '+', '0', '+', '+'],
        #   ['+', '0', '+', '0', '+'],
        #   ['+', '+', '0', '+', '+']], 3),

        # ([['+', '+', '+', '0', '+', '+', '+'],
        #   ['+', '+', '+', '0', '+', '+', '+'],
        #   ['+', '+', '0', '+', '+', '+', '+'],
        #   ['+', '+', '+', '0', '+', '+', '+'],
        #   ['+', '+', '+', '+', '0', '+', '+'],
        #   ['+', '+', '+', '+', '0', '+', '+']], 2),

        # ([['+', '+', '+', '0', '+', '+', '+'],
        #   ['+', '+', '+', '0', '+', '+', '+'],
        #   ['+', '+', '0', '+', '0', '+', '+'],
        #   ['+', '+', '+', '0', '+', '+', '+'],
        #   ['+', '+', '0', '+', '0', '+', '+'],
        #   ['+', '+', '0', '+', '+', '+', '+']], 3),

        # ([["x", "0", "x"],
        #   ["x", "x", "x"]], 3),

        # ([["x", "x", "x", "0", "x"],
        #   ["x", "x", "x", "x", "x"],
        #   ["x", "x", "x", "0", "x"]], 3),

        # ([["x", "0", "x"],
        #   ["x", "x", "x"]], 3),

        # ([["x", "x", "x", "0", "x"],
        #   ["x", "x", "x", "x", "x"],
        #   ["x", "x", "x", "0", "x"]], 3),

        # ([['x'],
        #   ['+']], 1),

        ([['+', '0', 'x', '+'],
          ['x', '+', 'x', '+'],
          ['x', '0', '+', '0'],
          ['0', '+', 'x', 'x'],
          ['+', '0', '+', 'x']], 4),

        # ([['x', '+', 'x', '+', '+', '+'],
        #   ['x', 'x', '0', '0', 'x', 'x'],
        #   ['x', '+', 'x', 'x', '0', 'x'],
        #   ['0', 'x', 'x', '0', '+', '+'],
        #   ['+', '+', 'x', '+', '0', '+'],
        #   ['0', '+', '+', 'x', '+', '+']], 2)
    ]
    for t in tests:
        res = get_min_bombs(t[0])
        print(["fail", "passed"][res == t[1]], res)


if __name__ == "__main__":
    main()
