#! /usr/bin/env python3

"""ОПИСАНИЕ:
Код состоит из четырех уникальных цифр (от 0 до 9).
Тесты вызовут ваше решение; вы должны ответить массивом из четырех цифр.
Ваш ввод - это количество совпадений (одна и та же цифра в том же месте) с вашим предыдущим ответом.
Для первого вызова вводимое значение равно -1 (т. е. каждый новый тест начинается с ввода -1),
вы должны найти код в 16 вызовах или меньше. Ты лучший. Сделай это.

Например
Код представляет собой [1, 2, 3, 4]
1-й вызов return [1, 3, 4, 5] выдаст 1 совпадения при следующем вводе,
2-й вызов return [1, 2, 3, 0] выдаст 3 совпадения при следующем вводе,
3-й вызов return [1, 2, 3, 4] не выдаст 4 совпадений при следующем вводе, потому что ты чемпион!

P.S.
Если задание кажется слишком сложным, попробуйте сначала эту игру почти с теми же правилами."""

#TODO: Я нихрена не понял что нужно сделать.